const CatalogItems = [
    {
        title: "Иван-чай с малиной",
        img_thumb: "img/catalog/ph-0001-small.jpg",
        img: "img/catalog/ph-0001.jpg",
        description: "<p>МАЛИНА дарит напитку изумительный вкус и аромат – сладкий с тонкой кислинкой. Ферментированный лист малины – это кладезь полезных веществ, а также незаменимое средство при простуде, эффективно снимает отеки и воспаления.</p>"
    },
    {
        title: "Иван-чай с липой",
        img_thumb: "img/catalog/ph-0002-small.jpg",
        img: "img/catalog/ph-0002.jpg",
        description: "<p>ЛИПОВЫЙ ЦВЕТ – первое средство при гриппе и простудных заболеваниях. Выводит из организма токсины. Противовоспалительное средство. Снимает отеки и спазмы. Придает чаю мягкий сладковатый вкус и дивный аромат. Не является лекарственным средством, не имеет противопоказаний, но не предназначен для частого употребления.</p>"
    },
    {
        title: "Иван-чай с голубикой и васильком",
        img_thumb: "img/catalog/ph-0003-small.jpg",
        img: "img/catalog/ph-0003.jpg",
        description: "<p>ГОЛУБИКА нормализует функцию поджелудочной железы, снижает уровень сахара в крови, снимает напряжение с глаз, выводит радиацию из организма, укрепляет стенки сосудов, способствует расщеплению жиров в организме. Улучшает процесс кроветворения и состав крови; тонизирует стенки капилляров; нормализует давление; предупреждает развитие онкологии. </p> <p>ВАСИЛЁК применяется при отёках почечного и сердечного происхождения, при ОРЗ с лихорадкой и головной болью, снимает спазмы гладкой мускулатуры внутренних органов. Полезен при лечении «куриной слепоты» (нарушениях сумеречного зрения).</p>"
    },
    {
        title: "Иван-чай ромашковый",
        img_thumb: "img/catalog/ph-0004-small.jpg",
        img: "img/catalog/ph-0004.jpg",
        description: "<p>Напиток чайный с РОМАШКОЙ АПТЕЧНОЙ обладает насыщенным медовым ароматом. Успокаивает, расслабляет и устраняет беспокойство. Восстанавливает микрофлору кишечника. Полезен при простудных и вирусных заболеваниях, улучшает аппетит, снимает спазмы, укрепляет нервную и пищеварительную системы. Стимулирует работу головного мозга, препятствует развитию аллергических реакций, расслабляет гладкую мускулатуру, снимает спазм, активирует мозговой кровоток.</p>"
    },
    {
        title: "Иван-чай черничный",
        img_thumb: "img/catalog/ph-0005-small.jpg",
        img: "img/catalog/ph-0005.jpg",
        description: "<p>ЧЕРНИКА снимает усталость глаз, улучшает зрение, снижает уровень сахара в крови, богата витаминами В1, С и РР. Повышает уровень гемоглобина, очищает печень, регулирует функцию поджелудочной железы, благотворно влияет на желудок.</p>"
    },
    {
        title: "Благо (Иван-чай с курильским чаем и черникой)",
        img_thumb: "img/catalog/ph-0006-small.jpg",
        img: "img/catalog/ph-0006.jpg",
        description: "<p>КУРИЛЬСКИЙ ЧАЙ используют вместо обычного чая. Применение напитка помогает при расстройствах нервной системы (депрессии, неврозы, нервные истощения), желудочно-кишечных инфекциях, дисбактериозе, сахарном диабете, гинекологических заболеваниях. Снижает, стабилизирует кровяное давление.</p> <p>ЧЕРНИКА снимает усталость глаз, улучшает зрение, снижает уровень сахара в крови, богата витаминами В1, С и РР. Повышает уровень гемоглобина, очищает печень, регулирует функцию поджелудочной железы, благотворно влияет на желудок.</p>"
    },
    {
        title: "Иван-чай с яблоком",
        img_thumb: "img/catalog/ph-0007-small.jpg",
        img: "img/catalog/ph-0007.jpg",
        description: "<p>ЯБЛОКИ благотворно влияют на нервную систему, иммунитет, работу памяти и интеллектуальные способности, понижают давление и помогают при тромбофлебите.</p>"
    },
    {
        title: "Иван-чай с сабельником",
        img_thumb: "img/catalog/ph-0008-small.jpg",
        img: "img/catalog/ph-0008.jpg",
        description: "<p>САБЕЛЬНИК обладает противовоспалительным, болеутоляющим и регенерирующим действием. Используется в качестве общеукрепляющего средства при повышенных нагрузках на опорно-двигательный аппарат. Применяется в комплексном лечении костно-суставных заболеваний (артриты, артрозы, подагра, остеохондроз и др.)</p>"
    },
    {
        title: "Иван-чай со зверобоем",
        img_thumb: "img/catalog/ph-0009-small.jpg",
        img: "img/catalog/ph-0009.jpg",
        description: "<p>ЗВЕРОБОЙ издавна народ Коми использовал как тонизирующее и иммуностимулирующее средство для повышения защитных сил организма, нормализации обмена веществ. Не подходит для частого применения. Увеличивает серотонин в крови, а следовательно, регулирует кровяное давление и приток крови через почки. Ответственен за правильное протекание защитной реакции в организме на внешнее воздействие и воспалительные процессы. Помогает преодолеть угнетённое настроение, оказывает расслабляющее действие, создаёт ощущение сытости, увеличивает умственные и психологические возможности человека, даёт уверенность в себе.</p>"
    },
    {
        title: "Иван-чай с кедровым орехом и брусникой",
        img_thumb: "img/catalog/ph-0010-small.jpg",
        img: "img/catalog/ph-0010.jpg",
        description: "<p>КЕДРОВЫЕ ОРЕШКИ – это ценный источник йода, фосфора, магния, железа, витаминов В1, В2, В3, А, Е, минералов. Содержат практически все незаменимые аминокислоты, полиненасыщенные жирные кислоты, сбалансированный растительный белок, который усваивается организмом на 99%. Повышают работоспособность человека, активно участвуют в росте и развитии организма.</p> <p>БРУСНИКА содержит витамины С, А, В1, В2, РР, калий, магний, фосфор, железо. Поднимает общий тонус, укрепляет сосуды, капилляры, сердце.</p>"
    },
    {
        title: "Иван-чай смородиновый",
        img_thumb: "img/catalog/ph-0011-small.jpg",
        img: "img/catalog/ph-0011.jpg",
        description: "<p>СМОРОДИНА – природный концентрат витаминов, микро- и макроэлементов. Стабилизирует кровяное давление, предупреждает болезнь Альцгеймера. Полезна при проблемах со зрением, сахарном диабете, болезнях почек и верхних дыхательных путей.</p>"
    },
    {
        title: "Иван-чай с цетрарией (исландский мох)",
        img_thumb: "img/catalog/ph-0012-small.jpg",
        img: "img/catalog/ph-0012.jpg",
        description: "ИСЛАНДСКИЙ МОХ (цетрария исландская) – одно из наиболее эффективных натуральных средств для лечения кашля, простуды, повышения иммунитета, лечения воспалительных заболеваний. Обладает противовоспалительным, иммуномодулирующим, антиоксидантным, противовирусным, антимикробным, желчегонным, обволакивающим, онкопротекторным действием.</p> <p>Рекомендована при истощении организма для восстановления тонуса.</p>"
    },
    {
        title: "Иван-чай с лепестками розы",
        img_thumb: "img/catalog/ph-0013-small.jpg",
        img: "img/catalog/ph-0013.jpg",
        description: "<p>«Однажды ты встретишь кого-то, кто будет любить тебя так, как Маленький Принц любит свою розу».</p> <p>Роза – символ любви, а ИВАН ЧАЙ С ЛЕПЕСТКАМИ САДОВОЙ РОЗЫ – само воплощение нежности, которая достигается благодаря эфирным маслам, которые придают напитку тонкий аромат и приятный вкус. Лепестки розы также обладают вяжущими, бактерицидными, противовоспалительными свойствами.</p>"
    },
    {
        title: "Иван-чай Разнотравие",
        img_thumb: "img/catalog/ph-0014-small.jpg",
        img: "img/catalog/ph-0014.jpg",
        description: "<p>РАЗНОТРАВИЕ – это лето севера в одной чайной упаковке. Разнотравие – это объединение для иммунитета и ярких дней Иван чая с: листом малины, шиповником, клевером, рябиной, чёрной смородиной, ромашкой, зверобоем, душицей, черёмухой, таволгой, лепестками садовой розы и молодых листьев берёзы (освященных на Троицын день). ЛИСТ МАЛИНЫ незаменимое средство при простуде. ШИПОВНИК - кладезь витаминов. КЛЕВЕР благотворно влияет на сердечно–сосудистую систему. ЛИСТ БЕРЁЗЫ снимает отёки, улучшает кровообращение. РЯБИНА предотвращает стрессы. СМОРОДИНА стабилизирует давление. РОМАШКА расслабляет. ДУШИЦА успокаивает нервную систему. ЧЕРЁМУХА замедляет процессы старения организма. ТАВОЛГА помогает снять усталость. ИВАН-ЧАЙ улучшает обмен веществ. ЛЕПЕСТКИ РОЗЫ богаты эфирными маслами, которые придают напитку тонкий аромат и приятный вкус.</p>"
    },
    {
        title: "Иван-чай с девясилом",
        img_thumb: "img/catalog/ph-0015-small.jpg",
        img: "img/catalog/ph-0015.jpg",
        description: "<p>ДЕВЯСИЛ используется как средство, снимающее воспалительные процессы, убивающее грибковые, бактериальные инфекции. Девясил способен остановить кровотечение и аллергические реакции. Обладает отхаркивающим, мочегонным и вяжущим действием. Признанное антигельминтное средство. Применяется и при болезнях дыхательных путей.</p>"
    },
]

/* Nano Templates - https://github.com/trix/nano */
function nano(template, data) {
    return template.replace(/\{([\w\.]*)\}/g, function (str, key) {
        var keys = key.split("."), v = data[keys.shift()];
        for (var i = 0, l = keys.length; i < l; i++) v = v[keys[i]];
        return (typeof v !== "undefined" && v !== null) ? v : "";
    });
}

// Функция заполнения каталога товарами
function fillCatalogItems() {
    var template = $("#catalog-item-template").html();
    var catalogRow = $("#catalog-row");
    for (var i = 0; i < CatalogItems.length; i++) {
        var v = CatalogItems[i];
        catalogRow.append(nano(template, v));
    }
}
